lvx/base/Documents/бит_му_МодернизацияОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_му_МодернизацияОС</Name>
			<Comment>(БИТ МУ)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.бит_Дополнительный_4</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоБюджетам</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_3</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_1</xr:Item>
				<xr:Item>InformationRegister.бит_му_ПараметрыОС</xr:Item>
				<xr:Item>AccumulationRegister.бит_СоответствиеОборотовТрансляции</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоТипамПроводок</xr:Item>
				<xr:Item>AccountingRegister.бит_Бюджетирование</xr:Item>
				<xr:Item>InformationRegister.бит_му_СобытияОС</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_5</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_2</xr:Item>
				<xr:Item>InformationRegister.бит_СоответствиеЗаписейТрансляции</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>Вид операции</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_му_ВидыОперацийМодернизацияОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение, по которому оформлен документ</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_ПодразделениеМСФО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МОЛ</Name>
					<Comment>МОЛ, по которому оформлен документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Comment>Ручная корректировка (служебный реквизит)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Пользователь, ответственный за заполнение данного документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтразитьВЗакрытомПериоде</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОсновныеСредства</Name>
					<Comment>Основные средства</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Comment>Основное средство</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокПолезногоИспользования_Старый</Name>
							<Comment>(МСФО)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокПолезногоИспользования</Name>
							<Comment>(МСФО)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактСрокИспользования</Name>
							<Comment>(МСФО)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемПродукцииРабот_Старый</Name>
							<Comment>(МСФО)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемПродукцииРабот</Name>
							<Comment>(МСФО)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактОбъемПродукцииРабот</Name>
							<Comment>(МСФО)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Comment>(МСФО)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаМодернизации</Name>
							<Comment>(МСФО)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФактическогоОбесценения</Name>
							<Comment>(МСФО)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Амортизация</Name>
							<Comment>(МСФО)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МетодНачисленияАмортизации_Старый</Name>
							<Comment>(МСФО)</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_му_МетодыНачисленияАмортизации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МетодНачисленияАмортизации</Name>
							<Comment>(МСФО)</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_му_МетодыНачисленияАмортизации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентУскорения_Старый</Name>
							<Comment>(МСФО)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентУскорения</Name>
							<Comment>(МСФО)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛиквидационнаяСтоимость_Старый</Name>
							<Comment>(МСФО)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛиквидационнаяСтоимость</Name>
							<Comment>(МСФО)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетНезавершенногоСтроительства</Name>
							<Comment>(МСФО)</Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Comment>Аналитика счета незавершенного строительства 1</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Comment>Аналитика счета незавершенного строительства 2</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Comment>Аналитика счета незавершенного строительства 3</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто4</Name>
							<Comment>Аналитика счета незавершенного строительства 4</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаМодернизации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

lvx/base/InformationRegisters/бит_му_СостоянияОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_му_СостоянияОС</Name>
			<Comment>(БИТ МУ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСостояния</Name>
					<Comment>Дата состояния</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Comment>Основное средство</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Состояние</Name>
					<Comment>Состояние</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_му_СостоянияОС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/base/InformationRegisters/бит_му_ПараметрыОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_му_ПараметрыОС</Name>
			<Comment>(БИТ МУ)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеПараметра</Name>
					<Comment>Значение параметра</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_му_ВидыПараметровВНА</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Comment>Основное средство</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Comment>Параметр</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_му_ВидыПараметровВНА</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/base/Enums/бит_му_ВидыОперацийМодернизацияОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_му_ВидыОперацийМодернизацияОС</Name>
			<Comment>(БИТ МУ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновныеСредства</Name>
					<Comment>Основные средства</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнвестиционнаяСобственность</Name>
					<Comment>Инвестиционная собственность</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

lvx/base/Documents/бит_му_МодернизацияОС/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем мВалютаМеждУчета Экспорт; // Хранит валюту международного учета

Перем мКоличествоСубконтоМУ Экспорт; // Хранит количество субконто международного учета в документа.

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Переменная, хранящее значение структуры шапки документа.
	Перем СтруктураШапкиДокумента;
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Проверка ручной корректировки
	Если бит_ОбщегоНазначения.РучнаяКорректировкаОбработкаПроведения(РучнаяКорректировка,Отказ,Заголовок,ЭтотОбъект, Ложь) Тогда
		Возврат
	КонецЕсли;
	
	// Подготовим структуру шапки документа.
	ПодготовитьСтруктуруШапкиДокумента(Заголовок, СтруктураШапкиДокумента, Отказ);	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	// Получим структуру курсов валют.
	СтруктураКурсыВалют = КурсыВалют(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	// Подготовим таблицы для возможности проведения.
	СтруктураТаблиц = ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента, СтруктураКурсыВалют);
	
	// Получим структуру курсов на даты принятия к учету.
	ИсторическиеКурсы = ИсторическиеКурсыВалют(СтруктураТаблиц.ОС, СтруктураКурсыВалют);
	
	// Проверить заполнение таблиц.
	ПроверитьЗаполнениеТаблицДокумента(СтруктураТаблиц, СтруктураШапкиДокумента, Отказ, Заголовок);
	
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, СтруктураТаблиц, СтруктураКурсыВалют, ИсторическиеКурсы, Отказ, Заголовок);
	КонецЕсли; 
	
КонецПроцедуры // ОбработкаПроведения()

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	бит_ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ, РучнаяКорректировка);

КонецПроцедуры // ОбработкаУдаленияПроведения()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		// В случае выполнения обмена данными не производить проверку.
		Возврат;			
	КонецЕсли; 
	
КонецПроцедуры // ПередЗаписью()
	
Процедура ПриЗаписи(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		// В случае выполнения обмена данными не производить проверку.
		Возврат;			
	КонецЕсли; 
		
	
		
КонецПроцедуры // ПриЗаписи()

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнитьШапкуДокумента();
	
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ПриКопировании(ОбъектКопирования)
	
	ЗаполнитьШапкуДокумента(ОбъектКопирования);
	
КонецПроцедуры // ПриКопировании()

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Функция подготавливает таблицу дат принятия ОС.
// 
// Параметры:
//  МассивОС - Массив
// 
// Возвращаемое значение:
//  ТаблицаЗначения
// 
Функция ПодготовитьТаблицуДатПринятияОС(МассивОС) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("СостояниеПринято", Перечисления.бит_му_СостоянияОС.ПринятоКУчету);
	Запрос.УстановитьПараметр("МассивОС", МассивОС);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_му_СостоянияОС.ОсновноеСредство,
	|	бит_му_СостоянияОС.ДатаСостояния КАК Период
	|ИЗ
	|	РегистрСведений.бит_му_СостоянияОС КАК бит_му_СостоянияОС
	|ГДЕ
	|	бит_му_СостоянияОС.ОсновноеСредство В(&МассивОС)
	|	И бит_му_СостоянияОС.Состояние = &СостояниеПринято
	|	И бит_му_СостоянияОС.Организация = &Организация";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
		
КонецФункции

// Функция готовит таблицы документа для проведения.
// 
// Возвращаемое значение:
//  СтруктураШапкиДокумента - Структура.
//  СтруктураКурсыВалют     - Структура.
// 
Функция ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента, СтруктураКурсыВалют)  Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация"			  , СтруктураШапкиДокумента.Организация);
	Запрос.УстановитьПараметр("МоментВремени"		  , МоментВремени());
	Запрос.УстановитьПараметр("Ссылка"				  , СтруктураШапкиДокумента.Ссылка);
	Запрос.УстановитьПараметр("СписокОС"			  , СтруктураШапкиДокумента.СписокОС);
	Запрос.УстановитьПараметр("СостояниеПринятоКУчету", Перечисления.бит_му_СостоянияОС.ПринятоКУчету);
	Запрос.УстановитьПараметр("СостояниеСнятоСУчета"  , Перечисления.бит_му_СостоянияОС.СнятоСУчета);
	Запрос.УстановитьПараметр("ПараметрСчетУчета"	  , ПланыВидовХарактеристик.бит_му_ВидыПараметровВНА.СчетУчета_ОС);
	Запрос.УстановитьПараметр("ПараметрКласс"	  	  , ПланыВидовХарактеристик.бит_му_ВидыПараметровВНА.Класс_ОС);
	Запрос.УстановитьПараметр("ПараметрФинАренда"	  , ПланыВидовХарактеристик.бит_му_ВидыПараметровВНА.ФинансоваяАренда_ОС);
	Запрос.УстановитьПараметр("ПараметрЦФО"	          , ПланыВидовХарактеристик.бит_му_ВидыПараметровВНА.ЦФО_ОС);
	Запрос.УстановитьПараметр("ПустойПараметр"		  , ПланыВидовХарактеристик.бит_му_ВидыПараметровВНА.ПустаяСсылка());
			
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПараметрыОС_МУ.ОсновноеСредство КАК ОсновноеСредство,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ПараметрыОС_МУ.Параметр = &ПараметрЦФО
	|				ТОГДА ПараметрыОС_МУ.ЗначениеПараметра
	|			ИНАЧЕ NULL
	|		КОНЕЦ) КАК ЦФО,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ПараметрыОС_МУ.Параметр = &ПараметрСчетУчета
	|				ТОГДА ПараметрыОС_МУ.ЗначениеПараметра
	|			ИНАЧЕ NULL
	|		КОНЕЦ) КАК СчетУчета,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ПараметрыОС_МУ.Параметр = &ПараметрКласс
	|				ТОГДА ПараметрыОС_МУ.ЗначениеПараметра.ВидКласса
	|			ИНАЧЕ NULL
	|		КОНЕЦ) КАК ВидКласса,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ПараметрыОС_МУ.Параметр = &ПараметрФинАренда
	|				ТОГДА ПараметрыОС_МУ.ЗначениеПараметра
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ОбъектВФинансовойАренде
	|ПОМЕСТИТЬ ТаблицаПараметров
	|ИЗ
	|	РегистрСведений.бит_му_ПараметрыОС.СрезПоследних(
	|			&МоментВремени,
	|			Организация = &Организация
	|				И ОсновноеСредство В (&СписокОС)
	|				И (Параметр = &ПараметрСчетУчета
	|					ИЛИ Параметр = &ПараметрКласс
	|					ИЛИ Параметр = &ПараметрФинАренда
	|					ИЛИ Параметр = &ПараметрЦФО)) КАК ПараметрыОС_МУ
	|
	|СГРУППИРОВАТЬ ПО
	|	ПараметрыОС_МУ.ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОсновныеСредства.НомерСтроки КАК НомерСтроки,
	|	ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.СрокПолезногоИспользования_Старый <> ОсновныеСредства.СрокПолезногоИспользования
	|			ТОГДА ОсновныеСредства.СрокПолезногоИспользования
	|		ИНАЧЕ &ПустойПараметр
	|	КОНЕЦ КАК СрокПолезногоИспользования,
	|	ОсновныеСредства.СуммаМодернизации КАК СуммаМодернизации,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.МетодНачисленияАмортизации_Старый <> ОсновныеСредства.МетодНачисленияАмортизации
	|			ТОГДА ОсновныеСредства.МетодНачисленияАмортизации
	|		ИНАЧЕ &ПустойПараметр
	|	КОНЕЦ КАК МетодНачисленияАмортизации,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.КоэффициентУскорения_Старый <> ОсновныеСредства.КоэффициентУскорения
	|			ТОГДА ОсновныеСредства.КоэффициентУскорения
	|		ИНАЧЕ &ПустойПараметр
	|	КОНЕЦ КАК КоэффициентУскорения,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.ОбъемПродукцииРабот_Старый <> ОсновныеСредства.ОбъемПродукцииРабот
	|			ТОГДА ОсновныеСредства.ОбъемПродукцииРабот
	|		ИНАЧЕ &ПустойПараметр
	|	КОНЕЦ КАК ПредполагаемыйОбъемПродукции,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.ЛиквидационнаяСтоимость_Старый <> ОсновныеСредства.ЛиквидационнаяСтоимость
	|			ТОГДА ОсновныеСредства.ЛиквидационнаяСтоимость
	|		ИНАЧЕ &ПустойПараметр
	|	КОНЕЦ КАК ЛиквидационнаяСтоимость,
	|	ПринятыеОС_МУ.ДатаСостояния КАК ДатаПринятия,
	|	ВыбывшиеОС_МУ.ДатаСостояния КАК ДатаВыбытия,
	|	ТаблицаПараметров.СчетУчета КАК СчетДт,
	|	ОсновныеСредства.СчетНезавершенногоСтроительства КАК СчетКт,
	|	ОсновныеСредства.Субконто1 КАК СубконтоКт1,
	|	ОсновныеСредства.Субконто2 КАК СубконтоКт2,
	|	ОсновныеСредства.Субконто3 КАК СубконтоКт3,
	|	ОсновныеСредства.Субконто4 КАК СубконтоКт4,
	|	ТаблицаПараметров.ВидКласса КАК ВидКласса,
	|	ТаблицаПараметров.ОбъектВФинансовойАренде КАК ОбъектВФинансовойАренде,
	|	ТаблицаПараметров.ЦФО КАК ЦФО
	|ИЗ
	|	Документ.бит_му_МодернизацияОС.ОсновныеСредства КАК ОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_му_СостоянияОС КАК ПринятыеОС_МУ
	|		ПО ОсновныеСредства.ОсновноеСредство = ПринятыеОС_МУ.ОсновноеСредство
	|			И (ПринятыеОС_МУ.Организация = &Организация)
	|			И (ПринятыеОС_МУ.Состояние = &СостояниеПринятоКУчету)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_му_СостоянияОС КАК ВыбывшиеОС_МУ
	|		ПО ОсновныеСредства.ОсновноеСредство = ВыбывшиеОС_МУ.ОсновноеСредство
	|			И (ВыбывшиеОС_МУ.Организация = &Организация)
	|			И (ВыбывшиеОС_МУ.Состояние = &СостояниеСнятоСУчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПараметров КАК ТаблицаПараметров
	|		ПО ОсновныеСредства.ОсновноеСредство = ТаблицаПараметров.ОсновноеСредство
	|ГДЕ
	|	ОсновныеСредства.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаПараметров";
	
	ТаблицаПоОС = Запрос.Выполнить().Выгрузить();
	
	СтруктураТаблиц = Новый Структура;
	СтруктураТаблиц.Вставить("ОС", ТаблицаПоОС);
	
	Возврат СтруктураТаблиц;
	
КонецФункции // ПодготовитьТаблицыДокумента()

// Процедура формирует структуру шапки документа и дополнительных полей.
// 
// Параметры:
//  Заголовок 				- Строка.
//  СтруктураШапкиДокумента - Структура.
//  Отказ 					- Булево.
// 
Процедура ПодготовитьСтруктуруШапкиДокумента(Заголовок, СтруктураШапкиДокумента, Отказ) Экспорт

	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Получим список ОС документа.
	СписокОС = ОсновныеСредства.ВыгрузитьКолонку("ОсновноеСредство");
	бит_РаботаСКоллекциями.УдалитьПовторяющиесяЭлементыМассива(СписокОС, Истина);
	
	СтруктураШапкиДокумента.Вставить("СписокОС", СписокОС);
	
	// Получим Вид класса ОС документа.
	Если ВидОперации = Перечисления.бит_му_ВидыОперацийМодернизацияОС.ОсновныеСредства Тогда
		ВидКласса = Перечисления.бит_му_ВидыКлассовОС.ОсновныеСредства;
	Иначе
		ВидКласса = Перечисления.бит_му_ВидыКлассовОС.ИнвестиционнаяСобственность;
	КонецЕсли;
	
	СтруктураШапкиДокумента.Вставить("ВидКласса_ОС", ВидКласса);
	
КонецПроцедуры // ПодготовитьСтруктуруШапкиДокумента()

// Процедура заполняет данные по основным средствам.
// 
// Параметры:
//  СписокОС 			   - СправочникСсылка.ОсновныеСредства, массив.
//  СтрокаТабличнойЧастиОС - СтрокаТабличнойЧасти.ОсновныеСредства.
//  НеИзменяемыеПараметры  - Булево.
// 
Процедура ЗаполнитьДанныеПоОсновнымСредствам(СписокОС,
	НеИзменяемыеПараметры, СтрокаТабличнойЧастиОС = Неопределено) Экспорт
	
	// Сформируем массив параметров ОС для получения.
	ПараметрыВНА = Новый Массив;
	ПараметрыВНА.Добавить(ПланыВидовХарактеристик.бит_му_ВидыПараметровВНА.КоэффициентУскорения_ОС);
	ПараметрыВНА.Добавить(ПланыВидовХарактеристик.бит_му_ВидыПараметровВНА.ЛиквидационнаяСтоимость_ОС);
	ПараметрыВНА.Добавить(ПланыВидовХарактеристик.бит_му_ВидыПараметровВНА.МетодНачисленияАмортизации_ОС);
	ПараметрыВНА.Добавить(ПланыВидовХарактеристик.бит_му_ВидыПараметровВНА.ПредполагаемыйОбъемПродукции_ОС);
	ПараметрыВНА.Добавить(ПланыВидовХарактеристик.бит_му_ВидыПараметровВНА.СрокПолезногоИспользования_ОС);
	ПараметрыВНА.Добавить(ПланыВидовХарактеристик.бит_му_ВидыПараметровВНА.СчетНачисленияАмортизации_ОС);
	ПараметрыВНА.Добавить(ПланыВидовХарактеристик.бит_му_ВидыПараметровВНА.СчетСниженияСтоимости_ОС);
	ПараметрыВНА.Добавить(ПланыВидовХарактеристик.бит_му_ВидыПараметровВНА.СчетУчета_ОС);
	
	// Сформируем структуру параметров для получения таблицы параметров ОС.
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Организация"     , Организация);
	СтруктураПараметров.Вставить("ОсновноеСредство", СписокОС);
	СтруктураПараметров.Вставить("МоментВремени"   , ?(ЭтоНовый(), КонецДня(Дата), МоментВремени()));
	СтруктураПараметров.Вставить("ПараметрыВНА"	   , ПараметрыВНА);
	
	// Получим таблицу параметров ОС.
	ТаблицаПараметровОС = бит_му_ВНА.ДанныеПараметровВНА(СтруктураПараметров, "ТаблицаЗначений");
	
	// Получим массив счетов по ОС.
	МассивСчетовАмортизации 	  = ТаблицаПараметровОС.ВыгрузитьКолонку("СчетНачисленияАмортизации_ОС");
	МассивСчетовСниженияСтоимости = ТаблицаПараметровОС.ВыгрузитьКолонку("СчетСниженияСтоимости_ОС");
	МассивСчетовУчета 			  = ТаблицаПараметровОС.ВыгрузитьКолонку("СчетУчета_ОС");
	
	бит_РаботаСКоллекциями.УдалитьПовторяющиесяЭлементыМассива(МассивСчетовАмортизации	    , Истина);
	бит_РаботаСКоллекциями.УдалитьПовторяющиесяЭлементыМассива(МассивСчетовСниженияСтоимости, Истина);
	бит_РаботаСКоллекциями.УдалитьПовторяющиесяЭлементыМассива(МассивСчетовУчета			, Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МоментВремени"				 , МоментВремени());
	Запрос.УстановитьПараметр("МассивСчетовАмортизации"		 , МассивСчетовАмортизации);
	Запрос.УстановитьПараметр("МассивСчетовСниженияСтоимости", МассивСчетовСниженияСтоимости);
	Запрос.УстановитьПараметр("МассивСчетовУчета"			 , МассивСчетовУчета);
	Запрос.УстановитьПараметр("СубконтоОС"					 , ПланыВидовХарактеристик.бит_ВидыСубконтоДополнительные_2.ОсновныеСредства);
	Запрос.УстановитьПараметр("ВидВНА"					 	 , Перечисления.бит_му_ВидыВНА.ОС);
	Запрос.УстановитьПараметр("Организация"					 , Организация);
	Запрос.УстановитьПараметр("СписокОС"					 , СписокОС);
	Запрос.УстановитьПараметр("ВведеноВЭксплуатацию"		 , Перечисления.бит_му_СостоянияОС.ПринятоКУчету);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВыработкаОС_МУ.ОбъектВНА КАК ОсновноеСредство,
	|	СУММА(ВыработкаОС_МУ.КоличествоОборот) КАК Количество
	|ПОМЕСТИТЬ ВыработкаОС_МУ
	|ИЗ
	|	РегистрНакопления.бит_му_ВыработкаВНА.Обороты(
	|			,
	|			&МоментВремени,
	|			,
	|			ВидВНА = &ВидВНА
	|				И Организация = &Организация
	|				И ОбъектВНА В (&СписокОС)) КАК ВыработкаОС_МУ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыработкаОС_МУ.ОбъектВНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СостоянияОС_МУ.ОсновноеСредство КАК ОсновноеСредство,
	|	ЕСТЬNULL(СтоимостьОС_МУ.СуммаМУОстатокДт, 0) КАК Стоимость,
	|	ЕСТЬNULL(АмортизацияОС_МУ.СуммаМУОстатокКт, 0) КАК Амортизация,
	|	ЕСТЬNULL(ФактОбесценениеОС_МУ.СуммаМУОстатокКт, 0) КАК СуммаФактическогоОбесценения,
	|	СостоянияОС_МУ.ДатаСостояния КАК ДатаВводаВЭксплуатацию,
	|	ЕСТЬNULL(ВыработкаОС_МУ.Количество, 0) КАК Количество
	|ИЗ
	|	РегистрСведений.бит_му_СостоянияОС КАК СостоянияОС_МУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.бит_Дополнительный_2.Остатки(
	|				&МоментВремени,
	|				Счет В (&МассивСчетовСниженияСтоимости),
	|				&СубконтоОС,
	|				Организация = &Организация
	|					И Субконто1 В (&СписокОС)) КАК ФактОбесценениеОС_МУ
	|		ПО СостоянияОС_МУ.ОсновноеСредство = ФактОбесценениеОС_МУ.Субконто1
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.бит_Дополнительный_2.Остатки(
	|				&МоментВремени,
	|				Счет В (&МассивСчетовУчета),
	|				&СубконтоОС,
	|				Организация = &Организация
	|					И Субконто1 В (&СписокОС)) КАК СтоимостьОС_МУ
	|		ПО СостоянияОС_МУ.ОсновноеСредство = СтоимостьОС_МУ.Субконто1
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.бит_Дополнительный_2.Остатки(
	|				&МоментВремени,
	|				Счет В (&МассивСчетовАмортизации),
	|				&СубконтоОС,
	|				Организация = &Организация
	|					И Субконто1 В (&СписокОС)) КАК АмортизацияОС_МУ
	|		ПО СостоянияОС_МУ.ОсновноеСредство = АмортизацияОС_МУ.Субконто1
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВыработкаОС_МУ КАК ВыработкаОС_МУ
	|		ПО СостоянияОС_МУ.ОсновноеСредство = ВыработкаОС_МУ.ОсновноеСредство
	|ГДЕ
	|	СостоянияОС_МУ.ОсновноеСредство В (&СписокОС)
	|	И СостоянияОС_МУ.Организация = &Организация
	|	И СостоянияОС_МУ.Состояние = &ВведеноВЭксплуатацию
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВыработкаОС_МУ";
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаТекущиеПараметрыАмортизации = РезультатЗапроса.Выгрузить();
	
	Если СтрокаТабличнойЧастиОС = Неопределено Тогда
		Для каждого СтрокаОС Из ОсновныеСредства Цикл
			ЗаполнитьПараметрыСтроки(СтрокаОС, ТаблицаТекущиеПараметрыАмортизации, ТаблицаПараметровОС, НеИзменяемыеПараметры);
		КонецЦикла;
	Иначе
		ЗаполнитьПараметрыСтроки(СтрокаТабличнойЧастиОС, ТаблицаТекущиеПараметрыАмортизации, ТаблицаПараметровОС, НеИзменяемыеПараметры);	
	КонецЕсли;
		
КонецПроцедуры // ЗаполнитьДанныеПоОсновнымСредствам()

// Процедура очищает недоступные параметры ОС в зависимости от метода начисления амортизации.
// 
// Параметры:
//  ТекущаяСтрока - СтрокаТабличнойЧасти.ОсновныеСредства.
// 
Процедура ОчиститьНедоступныеПараметрыОС(ТекущаяСтрока) Экспорт
	
	// Получим массив недоступных параметров.
	МассивНедоступныхПараметров = СформироватьМассивНедоступныхПараметров(ТекущаяСтрока);
	
	Для Каждого ТекИмяПараметра Из МассивНедоступныхПараметров Цикл
		ТекущаяСтрока[ТекИмяПараметра] = Неопределено;
	КонецЦикла;
	
КонецПроцедуры // ОчиститьНедоступныеПараметрыОС()

// Процедура вызывает процедуру по проверке ОС.
// 
// Параметры:
//  ОсновноеСредство - СправочникСсылка.ОсновныеСредства.
//  Отказ	 		 - Булево, по умолчанию Ложь.
// 
Процедура ПроверитьОСПриВыборе(ОсновноеСредство, Отказ) Экспорт
	
	Если ВидОперации = Перечисления.бит_му_ВидыОперацийМодернизацияОС.ОсновныеСредства Тогда
		ВидКласса = Перечисления.бит_му_ВидыКлассовОС.ОсновныеСредства;
	Иначе
		ВидКласса = Перечисления.бит_му_ВидыКлассовОС.ИнвестиционнаяСобственность;
	КонецЕсли;
	
	бит_му_ВНА.ПроверитьОСПриВыборе(ЭтотОбъект, ВидКласса, ОсновноеСредство, Отказ);
	
КонецПроцедуры // ПроверитьОСПриВыборе()

// Процедура синхронизирует реквизиты строки ОС с аналитикой счетов.
// 
// Параметры:
//  ТекущаяСтрока - СтрокаТабличнойЧасти.ОсновныеСредства.
//  ИмяСубконто   - Строка.
// 
Процедура СинхронизироватьРеквизитыСтрокиОС(ТекущаяСтрока, ИмяСубконто) Экспорт
	
	Если ТекущаяСтрока = Неопределено Тогда
		 Возврат;
	КонецЕсли; 

	Если ЗначениеЗаполнено(ТекущаяСтрока.ОсновноеСредство) Тогда
		// Адаптация для ERP. Начало. 18.03.2014{{
		ТипОС = Тип(бит_ОбщегоНазначения.ПолучитьИмяТипаОсновныеСредства());
		// Адаптация для ERP. Конец. 18.03.2014}}
		
		Для Ном = 1 По мКоличествоСубконтоМУ Цикл
			
			ТекИмяСубконто = ИмяСубконто + Ном;
			
			Если ТипЗнч(ТекущаяСтрока[ТекИмяСубконто]) = ТипОС Тогда
				 ТекущаяСтрока[ТекИмяСубконто] = ТекущаяСтрока.ОсновноеСредство;
			 КонецЕсли; 
		
		КонецЦикла;
	
	КонецЕсли;
	
КонецПроцедуры // СинхронизироватьРеквизитыСтрокиОС()

// Процедура обрабатывает изменение валюты документа.
// 
// Параметры:
//  Нет.
// 
Процедура ИзменениеВалютыМодуль() Экспорт

	СтруктураКурса = бит_КурсыВалют.ПолучитьКурсВалюты(ВалютаДокумента, Дата);
	
	КурсДокумента      = СтруктураКурса.Курс;
	КратностьДокумента = СтруктураКурса.Кратность;

КонецПроцедуры // ИзменениеВалютыМодуль()

// Функция получает параметры, передаваемые в обработку подбора ОС.
//
Функция ЗаполнитьПараметрыПодбора() Экспорт
	
	Если ВидОперации = Перечисления.бит_му_ВидыОперацийМодернизацияОС.ОсновныеСредства Тогда
		ВидКласса = Перечисления.бит_му_ВидыКлассовОС.ОсновныеСредства;
	Иначе
		ВидКласса = Перечисления.бит_му_ВидыКлассовОС.ИнвестиционнаяСобственность;
	КонецЕсли;
		
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыПодбора.Вставить("Режим"			    , Перечисления.бит_му_РежимыПодбораВНА.МодернизацияОС);
	ПараметрыПодбора.Вставить("ДатаНачала"		, НачалоМесяца(Дата));
	ПараметрыПодбора.Вставить("ДатаОкончания"		, КонецМесяца(Дата));
	ПараметрыПодбора.Вставить("Организация"		, Организация);
	ПараметрыПодбора.Вставить("МОЛ"				, МОЛ);
	ПараметрыПодбора.Вставить("Местонахождение"	, Подразделение);
	ПараметрыПодбора.Вставить("ВидКласса"			, ВидКласса);
	ПараметрыПодбора.Вставить("ВалютаДокумента"	, ВалютаДокумента);

	Возврат ПараметрыПодбора;
	
КонецФункции // ЗаполнитьПараметрыПодбора()

Процедура ЗаполнитьОсновныеСредства(ВыбранноеЗначение, МожноПерезаполнятьДанныеПоОС) Экспорт

	ОписаниеТаблицы = ВыбранноеЗначение.Данные;
	ТаблицаДанных   = бит_ОбщегоНазначения.РаспаковатьТаблицуИзМассива(ОписаниеТаблицы.ПереченьОбъектов, ОписаниеТаблицы.ПереченьОбъектов_Колонки);
	фКоличествоСубконтоМУ = 4;
	
	Для каждого СтрокаТаблицы Из ТаблицаДанных Цикл
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ОсновноеСредство", СтрокаТаблицы.ВНА);
		
		МассивСтрок = ОсновныеСредства.НайтиСтроки(СтруктураОтбора);
		
		НайденнаяСтрока = ?(МассивСтрок.Количество() = 0, Неопределено, МассивСтрок[0]); 		
		Если НайденнаяСтрока = Неопределено Тогда
			
			НоваяСтрока = ОсновныеСредства.Добавить();
						
			НоваяСтрока.ОсновноеСредство  = СтрокаТаблицы.ВНА;
			НоваяСтрока.СуммаМодернизации = СтрокаТаблицы.СуммаМодернизации;
			
			Отказ = Ложь;
			Документы.бит_му_МодернизацияОС.ПолучитьПараметрыОССервер(НоваяСтрока, ЭтотОбъект, МожноПерезаполнятьДанныеПоОС, Отказ);
			
			Если Отказ Тогда
				ОсновныеСредства.Удалить(НоваяСтрока);
			КонецЕсли;
			
			НоваяСтрока.ДатаМодернизации = СтрокаТаблицы.ДатаМодернизации;
			
			Контекст = Новый Структура("ОстСрокИспользования,"
									   "СрокПолезногоИспользования,"
									   "ФактСрокИспользования,"
									   "ОстОбъемПродукцииРабот,"
									   "ОбъемПродукцииРабот,"
									   "ФактОбъемПродукцииРабот,"
									   "ОстСтоимость,"
									   "Стоимость,"
									   "СуммаМодернизации,"
									   "СуммаФактическогоОбесценения,"
									   "Амортизация"); 
									   
			ЗаполнитьЗначенияСвойств(Контекст, НоваяСтрока);						   
									   
			// Расчеты?
			Документы.бит_му_МодернизацияОС.ВыполнитьВсеРасчетыДляСтрокиОС(Контекст);
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Контекст);
			
			// Выполним подбор счетов.
			Документы.бит_му_МодернизацияОС.ВыполнитьПодборСчетов(НоваяСтрока, СтрокаТаблицы, ЭтотОбъект, фКоличествоСубконтоМУ);
		
		Иначе

			СтрокаОС = Строка(СтрокаТаблицы.ВНА) + ?(ЗначениеЗаполнено(СтрокаТаблицы.ИнвентарныйНомер), 
													 НСтр("ru = 'инв. №'; en = 'inv. №'") + СтрокаТаблицы.ИнвентарныйНомер, "");
			ТекстСообщения = НСтр("ru = 'Основное средство ""%1"" уже подобрано в строке №%2.'; 
			                      |en = 'Fixed asset ""%1"" is already matched in line №%2.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаОС, НайденнаяСтрока.НомерСтроки);				 
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
		КонецЕсли; 
		
	КонецЦикла; // По строкам таблицы данных
			
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура выполняет валютные пересчеты ВНА.
// 
// Параметры:
//  ТекущиеПараметры.
//  ПараметрыОС          - Булево (По умолчанию = Ложь).
//  ПараметрыАмортизации - Булево (По умолчанию = Ложь).
// 
Процедура ВыполнитьВалютныеПересчетыВНА(ТекущиеПараметры, ПараметрыОС = Ложь, ПараметрыАмортизации = Ложь)
	
	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	ВидыКурсов = Новый Структура("МУ, Документ");	
	СтруктураКурсыВалют = бит_му_ОбщегоНазначения.КурсыВалютДокументаМУ(ЭтотОбъект, СтруктураШапкиДокумента.Дата, ВидыКурсов);
	
	МассивСуммДляПересчета = Новый Массив;
	
	Если ПараметрыОС Тогда
		ОС = ТекущиеПараметры.ВНА;
		МассивСуммДляПересчета.Добавить("ЛиквидационнаяСтоимость_ОС");
	Иначе
		ОС = ТекущиеПараметры.ОсновноеСредство;
		МассивСуммДляПересчета.Добавить("Амортизация");
		МассивСуммДляПересчета.Добавить("Стоимость");
		МассивСуммДляПересчета.Добавить("СуммаФактическогоОбесценения");
	КонецЕсли; 

	МассивОС = Новый Массив;
	МассивОС.Добавить(ОС);
	
	ТаблицаДанных = ПодготовитьТаблицуДатПринятияОС(МассивОС);
	ТаблицаПериодов = ТаблицаДанных.Скопировать(, "Период");
	Курсы = бит_КурсыВалют.ПолучитьКурсыВалютПоПериодам(ТаблицаПериодов, СтруктураКурсыВалют);
	
	СоответствиеКурсовИОС = Новый Соответствие;
	
	Для каждого Строка Из ТаблицаДанных Цикл
		СоответствиеКурсовИОС.Вставить(Строка.ОсновноеСредство, Курсы[Строка.Период])
	КонецЦикла; 

	КурсыМУ 	  = СоответствиеКурсовИОС[ОС].МУ;
	КурсыДокумент = СоответствиеКурсовИОС[ОС].Документ;
	
	Для каждого ИмяСуммы Из МассивСуммДляПересчета Цикл
			
			
		ТекущиеПараметры[ИмяСуммы] = бит_КурсыВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(ТекущиеПараметры[ИмяСуммы]
								,КурсыМУ.Валюта
								,КурсыДокумент.Валюта
								,КурсыМУ.Курс
								,КурсыДокумент.Курс
								,КурсыМУ.Кратность
								,КурсыДокумент.Кратность);
	КонецЦикла; 
		
КонецПроцедуры

// Функция формирует массив недоступных параметров ОС в зависимости от
// от метода начисления амортизации.
// 
// Параметры:
//  ТекущаяСтрока 			 - СтрокаТабличнойЧасти.ОсновныеСредства.
//  ЭтоУправлениеДоступность - Булево, по умолчанию Ложь.
// 
// Возвращаемое значение:
//  МассивНедоступныхПараметров - Массив;
// 
Функция СформироватьМассивНедоступныхПараметров(ТекущаяСтрока, ЭтоУправлениеДоступность = Ложь)
	
	МассивНедоступныхПараметров = Новый Массив;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат МассивНедоступныхПараметров;
	КонецЕсли;
	
	МенеджерПеречисления 		     = Перечисления.бит_му_МетодыНачисленияАмортизации;
	МетодНачисленияАмортизации_Новый = ТекущаяСтрока.МетодНачисленияАмортизации;
	
	Если МетодНачисленияАмортизации_Новый = МенеджерПеречисления.Линейный Тогда
		
		МассивНедоступныхПараметров.Добавить("КоэффициентУскорения");
		МассивНедоступныхПараметров.Добавить("ОбъемПродукцииРабот");
		
		Если ЭтоУправлениеДоступность Тогда
			МассивНедоступныхПараметров.Добавить("ФактОбъемПродукцииРабот");
			МассивНедоступныхПараметров.Добавить("ОстОбъемПродукцииРабот");
		КонецЕсли;
		
	ИначеЕсли МетодНачисленияАмортизации_Новый = МенеджерПеречисления.УменьшаемогоОстатка Тогда
		
		МассивНедоступныхПараметров.Добавить("ОбъемПродукцииРабот");
		
		Если ЭтоУправлениеДоступность Тогда
			МассивНедоступныхПараметров.Добавить("ФактОбъемПродукцииРабот");
			МассивНедоступныхПараметров.Добавить("ОстОбъемПродукцииРабот");
		КонецЕсли;
		
	ИначеЕсли МетодНачисленияАмортизации_Новый = МенеджерПеречисления.Производственный Тогда
		
		МассивНедоступныхПараметров.Добавить("КоэффициентУскорения");
		
	КонецЕсли;
	
	Возврат МассивНедоступныхПараметров;
	
КонецФункции // СформироватьМассивНедоступныхПараметров()

// Процедура заполняет шапку документа по умолчанию.
// 
// Параметры:
//  ОбъектКопирования
// 
Процедура ЗаполнитьШапкуДокумента(ОбъектКопирования = Неопределено)
	
	// Заполним шапку документа значениями по умолчанию.
	бит_ОбщегоНазначения.ЗаполнитьШапкуДокумента(ЭтотОбъект, Пользователи.ТекущийПользователь(), ОбъектКопирования);
								
	Если НЕ ЗначениеЗаполнено(ВалютаДокумента) Тогда
		ВалютаДокумента = бит_му_ОбщегоНазначения.ПолучитьВалютуМеждународногоУчета(Организация);
		СтрКурса        = бит_КурсыВалют.ПолучитьКурсВалюты(ВалютаДокумента, ?(Дата = '0001-01-01', ТекущаяДатаСеанса(), Дата));
		Курс            = СтрКурса.Курс;
		Кратность       = СтрКурса.Кратность;
	КонецЕсли; 

КонецПроцедуры

// Процедура заполняет параметры текущей строки.
// 
// Параметры:
//  ТекСтрока                          - Строка табличной части "Основные средства".
//  ТаблицаТекущиеПараметрыАмортизации - ТаблицаЗначений.
//  ТаблицаПараметровОС 			   - ТаблицаЗначений.
//  НеИзменяемыеПараметры              - Булево.
// 
Процедура ЗаполнитьПараметрыСтроки(ТекСтрока, ТаблицаТекущиеПараметрыАмортизации, ТаблицаПараметровОС, НеИзменяемыеПараметры)

	ТекущиеПараметрыАмортизации = ТаблицаТекущиеПараметрыАмортизации.Найти(ТекСтрока.ОсновноеСредство, "ОсновноеСредство");
    ТекущиеПараметрыОС			= ТаблицаПараметровОС.Найти(ТекСтрока.ОсновноеСредство				 , "ВНА");
	
	Если НЕ ТекущиеПараметрыАмортизации = Неопределено Тогда
		ВыполнитьВалютныеПересчетыВНА(ТекущиеПараметрыАмортизации,,Истина);
	КонецЕсли; 
	
	Если НЕ ТекущиеПараметрыОС = Неопределено Тогда  // было ТекущиеПараметрыАмортизации
		ВыполнитьВалютныеПересчетыВНА(ТекущиеПараметрыОС,Истина);
	КонецЕсли;
	
	Если ТекущиеПараметрыАмортизации = Неопределено Тогда
		
		// Очистим реквизиты строки ОС.
		ОчиститьРеквизитыСтрокиОС(ТекСтрока);
		
		ТекСтрока.СуммаМодернизации = 0;
		
	Иначе

		Если ТекущиеПараметрыОС = Неопределено Тогда
			// Очистим реквизиты строки ОС.
			ОчиститьРеквизитыСтрокиОС(ТекСтрока);
		Иначе
			
			ТекСтрока.СрокПолезногоИспользования_Старый = ТекущиеПараметрыОС.СрокПолезногоИспользования_ОС;
			ТекСтрока.МетодНачисленияАмортизации_Старый = ТекущиеПараметрыОС.МетодНачисленияАмортизации_ОС;
			ТекСтрока.КоэффициентУскорения_Старый 		= ТекущиеПараметрыОС.КоэффициентУскорения_ОС;
			ТекСтрока.ОбъемПродукцииРабот_Старый 		= ТекущиеПараметрыОС.ПредполагаемыйОбъемПродукции_ОС;
			ТекСтрока.ЛиквидационнаяСтоимость_Старый 	= ТекущиеПараметрыОС.ЛиквидационнаяСтоимость_ОС;
			
			// Если это заполнение всех параметров, тогда.
			Если Не НеИзменяемыеПараметры Тогда
				
				ТекСтрока.СрокПолезногоИспользования = ТекущиеПараметрыОС.СрокПолезногоИспользования_ОС;
				ТекСтрока.МетодНачисленияАмортизации = ТекущиеПараметрыОС.МетодНачисленияАмортизации_ОС;
				ТекСтрока.КоэффициентУскорения       = ТекущиеПараметрыОС.КоэффициентУскорения_ОС;
				ТекСтрока.ОбъемПродукцииРабот        = ТекущиеПараметрыОС.ПредполагаемыйОбъемПродукции_ОС;
				ТекСтрока.ЛиквидационнаяСтоимость    = ТекущиеПараметрыОС.ЛиквидационнаяСтоимость_ОС;
				
			КонецЕсли;
			
			ДатаВводаВЭксплуатацию = ТекущиеПараметрыАмортизации.ДатаВводаВЭксплуатацию;
			ФактСрокИспользования  = ?(ДатаВводаВЭксплуатацию = NULL
									  , 0
									  , бит_му_ВНА.ОпределитьФактическийСрокИспользования(Организация, ТекСтрока.ОсновноеСредство, Дата));
			
			ТекСтрока.ФактСрокИспользования   = ФактСрокИспользования;
			ТекСтрока.ФактОбъемПродукцииРабот = ТекущиеПараметрыАмортизации.Количество;
			
		КонецЕсли;
		
		ТекСтрока.Стоимость          		   = ТекущиеПараметрыАмортизации.Стоимость;
		ТекСтрока.Амортизация        		   = ТекущиеПараметрыАмортизации.Амортизация;
		ТекСтрока.СуммаФактическогоОбесценения = ТекущиеПараметрыАмортизации.СуммаФактическогоОбесценения;
		
		// Очистим параметры ОС недоступные для текущего метода ничасления амортизации.
		ОчиститьНедоступныеПараметрыОС(ТекСтрока);
		
		// Если это заполнение не изменяемых параметров, тогда.
		Если НеИзменяемыеПараметры Тогда
			ТекстСообщения = НСтр("ru='Заполнение параметров для основного средства ""%1""  выполнено.';
			                      |en='Filling-in parameters for capital asset ""%1"" completed.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ТекСтрока.ОсновноеСредство);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
			
	КонецЕсли;

КонецПроцедуры // ЗаполнитьПараметрыСтроки()

// Процедура проверяет правильность заполнения строк таблиц документа.
// 
// Параметры: 
//  СтруктураТаблиц			- Структура, таблицы значений, содержащая данные для проведения и проверки.
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа.
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
// 
Процедура ПроверитьЗаполнениеТаблицДокумента(СтруктураТаблиц, СтруктураШапкиДокумента, Отказ, Заголовок)
		
	// Проверим наличие дублей в табличной части "ОсновныеСредства".
	бит_ОбщегоНазначения.ПроверитьДублированиеЗначенийВТабличнойЧасти(ЭтотОбъект
																	 , "ОсновныеСредства"
																	 , Новый Структура("ОсновноеСредство")
																	 , Отказ
																	 , Заголовок);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаПоОС = СтруктураТаблиц.ОС;
	КолонкиОС	= ТаблицаПоОС.Колонки;
	ВидКласса   = СтруктураШапкиДокумента.ВидКласса_ОС;
	
	// Проверим таблицу ОС по строчно.
	Для Каждого ТекСтрока Из ТаблицаПоОС Цикл
		
		ТекущийВидКласса = ТекСтрока.ВидКласса;
			
		Если ВидКласса <> ТекущийВидКласса Тогда
			
			ТекстСообщения = НСтр("ru = 'В строке №%1 табличной части ""Основные средства"" вид класса %2 основного средства %3 не соответствует виду операции документа.'; 
			                      |en = 'In line №%1 of the fixed assets tabular part, the class type %2 of fixed asset %3 does not correspond to the document transaction type.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ТекСтрока.НомерСтроки, ТекущийВидКласса, ТекСтрока.ОсновноеСредство);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
					
		Иначе	
			
			// Проверим заполненность значений строки.
			бит_му_ВНА.ПроверитьСтрокуТаблицыОС(ТекСтрока, КолонкиОС, СтруктураШапкиДокумента, Отказ, Заголовок);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ПроверитьЗаполнениеТаблицДокумента()

// Процедура выполняет движения по регистрам.
//             
// Параметры:
//  СтруктураШапкиДокумента - Структура.
//  СтруктураТаблиц 		- Структура.
//  СтруктураКурсыВалют 	- Структура.
//  ИсторическиеКурсы 		- Структура.
//  Отказ                   - Булево.
//  Заголовок				- Строка.
// 
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, СтруктураТаблиц, СтруктураКурсыВалют, ИсторическиеКурсы, Отказ, Заголовок)
	
	ДатаДока       = СтруктураШапкиДокумента.Дата;
	ТекОрганизация = СтруктураШапкиДокумента.Организация;
	ТаблицаДанных  = СтруктураТаблиц.ОС;
	
	// Движения по регистру сведений "бит_му_СобытияОС".
	НаборЗаписей   = Движения.бит_му_СобытияОС;
	ТаблицаЗаписей = НаборЗаписей.Выгрузить();
	ТаблицаЗаписей.Очистить();
	
	Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл
		Запись = ТаблицаЗаписей.Добавить();
		Запись.ОсновноеСредство = СтрокаТаблицы.ОсновноеСредство;
	КонецЦикла;
	
	Событие = Перечисления.бит_му_СобытияОС.Модернизация;
	
	ТаблицаЗаписей.ЗаполнитьЗначения(ДатаДока	   , "Период");
	ТаблицаЗаписей.ЗаполнитьЗначения(Истина		   , "Активность");
	ТаблицаЗаписей.ЗаполнитьЗначения(ТекОрганизация, "Организация");
	ТаблицаЗаписей.ЗаполнитьЗначения(Событие	   , "Событие");
	
	НаборЗаписей.Загрузить(ТаблицаЗаписей);
	
	// Движения по регистру сведений "бит_му_ПараметрыОС".
	НаборЗаписей   = Движения.бит_му_ПараметрыОС;
	
	ВидыПараметров = бит_му_ВНА.ПолучитьВидыПараметров(ПланыВидовХарактеристик.бит_му_ВидыПараметровВНА.ОсновныеСредства);
	бит_му_ВНА.ЗаписатьПараметрыВНА(НаборЗаписей, СтруктураШапкиДокумента, ТаблицаДанных, ВидыПараметров, "ОС");
	
	// Движение по регистру бухгалтерии "бит_Дополнительный_2 (Международный)".
	НаборЗаписей = Движения.бит_Дополнительный_2;
	
	Если СтруктураШапкиДокумента.ВидОперации = Перечисления.бит_му_ВидыОперацийМодернизацияОС.ОсновныеСредства Тогда
		СодержаниеДвижения = Нстр("ru = 'Модернизация ОС'; en = 'Upgrade FA'");
	Иначе
		СодержаниеДвижения = Нстр("ru = 'Модернизация ИС'; en = 'Upgrade intellectual property'");
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл
		
		// ДТ СчетУчетаОС КТ СчетНезавершенногоСтроительства СуммаМодернизации.
		СоздатьЗаписьПоНачислениюМодернизации(СтруктураШапкиДокумента
											 , НаборЗаписей
											 , СтрокаТаблицы
											 , ИсторическиеКурсы.Получить(СтрокаТаблицы.ДатаПринятия)
											 , СодержаниеДвижения);
		
	КонецЦикла;
	
КонецПроцедуры // ДвиженияПоРегистрам()

// Функция получает структуру курсов валют.
// 
// Параметры:
//  СтруктураШапкиДокумента - Структура.
//  Отказ					- Булево.
//  Заголовок				- Строка.
// 
// Возвращаемое значение:
//  СтруктураКурсыВалют - Структура.
// 
Функция КурсыВалют(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	ВидыКурсов = Новый Структура("Упр, Регл, МУ, Документ");
	СтруктураКурсыВалют = бит_му_ОбщегоНазначения.КурсыВалютДокументаМУ(ЭтотОбъект, СтруктураШапкиДокумента.Дата, ВидыКурсов);
	
	// Получим валюту международного учета.
	СтрКурсов = СтруктураКурсыВалют.МУ;
	мВалютаМеждУчета = СтрКурсов.Валюта;
	
	Если Не ЗначениеЗаполнено(мВалютаМеждУчета) Тогда
		
		ТекстСообщения = НСтр("ru = 'Для организации ""%1"" не указана валюта международного учета.'; 
		                      |en = 'The organization ""%1"" does not have an international accounting currency.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, СтруктураШапкиДокумента.Организация);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		
		Возврат Новый Структура;
	КонецЕсли;
	
	Возврат СтруктураКурсыВалют;
	
КонецФункции // КурсыВалют()

// Функция получает курсы валют на даты принятия к учету ОС.
// 
// Параметры:
// 	ТаблицаДанных - ТаблицаЗначений - таблица данных по ОС.
// 	СтруктураКурсыВалют - Структура - курсы валют на дату документа.
// 
// Возвращаемое значение:
// 	Курсы - Соответствие - значения курсов на дату принятия к учету будут иметь.
// 						   аналогичную структуру как и СтруктураКурсыВалют.
// 
Функция ИсторическиеКурсыВалют(ТаблицаДанных, СтруктураКурсыВалют)
	
	ТаблицаПериодов = ТаблицаДанных.Скопировать( , "ДатаПринятия");
	ТаблицаПериодов.Колонки.ДатаПринятия.Имя = "Период";
	ТаблицаПериодов.Свернуть("Период");
	
	Курсы = бит_КурсыВалют.ПолучитьКурсыВалютПоПериодам(ТаблицаПериодов, СтруктураКурсыВалют);
	
	Возврат Курсы;
	
КонецФункции // ИсторическиеКурсыВалют()

// Процедура формирует проводку по модернизации.
// 
// Параметры:
//  СтруктураШапкиДокумента - Структура.
//  НаборЗаписей			- РегистрБухгалтерииНаборЗаписей.бит_Дополнительный_2.
//  СтрокаТаблицы           - СтрокаТаблицыЗначений.
//  СтруктураКурсыВалют     - Структура.
//  СодержаниеДвижения		- Строка.
// 
Процедура СоздатьЗаписьПоНачислениюМодернизации(СтруктураШапкиДокумента
											   , НаборЗаписей
											   , СтрокаТаблицы
											   , СтруктураКурсыВалют
											   , СодержаниеДвижения)
	
	Запись = НаборЗаписей.Добавить();
	
	// Заполнение атрибутов записи.
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Организация", СтруктураШапкиДокумента.Организация);
	СтруктураПараметров.Вставить("Период",      СтруктураШапкиДокумента.Дата);
	СтруктураПараметров.Вставить("Валюта",      СтруктураКурсыВалют.Документ.Валюта);
	СтруктураПараметров.Вставить("СчетДт",      СтрокаТаблицы.СчетДт);
	СтруктураПараметров.Вставить("СчетКт",      СтрокаТаблицы.СчетКт);
	СтруктураПараметров.Вставить("Сумма",       СтрокаТаблицы.СуммаМодернизации);
	СтруктураПараметров.Вставить("Содержание",  СодержаниеДвижения);
											   
	бит_му_ОбщегоНазначения.ЗаполнитьЗаписьРегистраМУ(Запись, СтруктураПараметров);											   
	
	// Заполним аналитику счета Дт и Кт.
	бит_му_ОбщегоНазначения.УстановитьСубконто(Запись.СчетДт,Запись.СубконтоДт,"ОсновныеСредства", СтрокаТаблицы.ОсновноеСредство);		
	бит_му_ОбщегоНазначения.УстановитьСубконто(Запись.СчетДт,Запись.СубконтоДт,"ЦФО", СтрокаТаблицы.ЦФО);
	
	// Заполнение аналитики	
	Для НомерСубконто = 1 По мКоличествоСубконтоМУ Цикл
		бит_му_ОбщегоНазначения.УстановитьСубконто(Запись.СчетКт,Запись.СубконтоКт,НомерСубконто,СтрокаТаблицы["СубконтоКт"+НомерСубконто]);			
	КонецЦикла;
	
	// Выполним валютные пересчеты.
	бит_му_ОбщегоНазначения.ВыполнитьВалютныеПересчетыЗаписи(СтруктураПараметров, Запись, СтруктураКурсыВалют);
	
КонецПроцедуры // СоздатьЗаписьПоНачислениюМодернизации()

// Процедура очищает реквизиты строки табличной части ОС.
// 
// Параметры:
//  СтрокаТабличнойЧастиОС - СтрокаТабличнойЧасти.ОсновныеСредства.
// 
Процедура ОчиститьРеквизитыСтрокиОС(СтрокаТабличнойЧастиОС)
	
	МассивИмен = Новый Массив; 
	МассивИмен.Добавить("СрокПолезногоИспользования_Старый"); 
	МассивИмен.Добавить("МетодНачисленияАмортизации_Старый");
	МассивИмен.Добавить("КоэффициентУскорения_Старый");
	МассивИмен.Добавить("ОбъемПродукцииРабот_Старый");
	МассивИмен.Добавить("ЛиквидационнаяСтоимость_Старый");
	МассивИмен.Добавить("СрокПолезногоИспользования");
	МассивИмен.Добавить("ФактСрокИспользования");
	МассивИмен.Добавить("Стоимость");
	МассивИмен.Добавить("Амортизация");
	МассивИмен.Добавить("СуммаФактическогоОбесценения");
	МассивИмен.Добавить("МетодНачисленияАмортизации");
	МассивИмен.Добавить("КоэффициентУскорения");
	МассивИмен.Добавить("ОбъемПродукцииРабот");
	МассивИмен.Добавить("ФактОбъемПродукцииРабот");
	МассивИмен.Добавить("ЛиквидационнаяСтоимость");
	
	Для Каждого ТекИмя Из МассивИмен Цикл
		СтрокаТабличнойЧастиОС[ТекИмя] = Неопределено;
	КонецЦикла;
	
КонецПроцедуры // ОчиститьРеквизитыСтрокиОС()


#КонецОбласти

#Область Инициализация

мКоличествоСубконтоМУ = 4;

#КонецОбласти    

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
